[
  {
    "header": "Vision",
    "content": "GitLabâ\u0080\u0099s 10-year product vision is inspired by our mission to make it so that everyone can contribute. Today GitLab is the DevSecOps Platform, empowering organizations to maximize the overall return on software development by delivering software faster and efficiently, while strengthening security and compliance. We believe our DevSecOps platform vision is shared by market analysts who have coined it the Value Stream Delivery Platform market. Over the next ten years, our vision is to expand GitLab in the following ways. First, we expect to continue rapidly maturing our DevSecOps platform so that GitLab is able to replace any DevSecOps point solution. To replace any DevSecOps solution will require most of our categories to be complete, which is likely a 10 year journey. To ensure rapid progress, we have a 3-year goal to have 50% of our categories at complete maturity by the end of 2023, and this three year product strategy articulates our current focus. Once we achieve that goal, there will still be more work to do, but having half our categories complete will mean most DevSecOps tools are replaceable by GitLab. Second, we expect GitLab to expand its DevSecOps platform to provide similar support for ModelOps and DataOps. Over time, data and machine learning/AI models will increasingly power software experiences. Our customers will need an ability to manage data and its associated ML/AI models in a similar fashion to software projects. We endeavor to support data scientists and data engineers just as we support software developers today, by enabling rapid development, testing, production deployment, and monitoring of data models. We would also expect to automate handling of product usage data collection, GDPR compliance of data under management, cookie and privacy management, experimentation tools, A/B testing, etc. Third, we expect GitLab to become a creation platform for all digital content. This will require us to expand beyond traditional software development. Possible new digital content creation formats we could support include low code/no code development, design creation, and other creative media like music and movies. It would also likely require enhanced content management to better enable customers to create great digital experiences for their users. We execute on our vision rapidly and efficiently by leveraging the best practices of 100,000 organizations co-developing the DevSecOps platform of their dreams. We take a\nseed then nurture approach to maturing our product surface area over time, all the while,\nfocusing on customer results. We leverage sensing mechanisms and product usage data to make decisions about where to increase or decrease investment. You can read more about the principles that guide our prioritization and product thinking in\nour product handbook."
  },
  {
    "header": "Situation",
    "content": "GitLab competes in a large market space and is uniquely positioned with a vision to offer a single application for the entire DevSecOps lifecycle. GitLab competes across numerous market segments and aims to deliver value in 80+ market categories. GitLabâ\u0080\u0099s product vision is uniquely ambitious, as we were the first DevSecOps player to take a single application approach. From idea to production, GitLab helps teams improve cycle time from weeks to minutes, reduce development process costs, and enable a faster time to market while increasing developer productivity. With software â\u0080\u009ceating the world,â\u0080\u009d this is widely viewed as a mission-critical value proposition for customers. We also have a number of tailwinds in the form of cloud adoption, Kubernetes adoption, and DevSecOps tool consolidation, which are helping fuel our rapid growth. Finally, GitLab has an open source community and distribution model, which has exposed the value of GitLab to millions of developers and has sped up the maturation of our product through more than 200 monthly improvements to the GitLab codebase from our users."
  },
  {
    "header": "Job to be Done",
    "content": "Every product should have a single job that it strives to do. At GitLab we use the Jobs to be Done (JTBD) framework. A JTBD is the reason why people employ a product. GitLab's overarching Job to be Done is:"
  },
  {
    "header": "Fiscal year guiding principles",
    "content": "These principles guide our decisions about which areas of the product we will invest in during the current fiscal year."
  },
  {
    "header": "Depth over breadth",
    "content": "For the past several years we have focused on breadth over depth. This has allowed us to show our direction as a company and define the Devops Platform market. In FY24, we are pivoting to depth over breadth as product depth will allow us to win and retain sophisticated enterprise customers. We will focus on adding depth to the key areas that make GitLabâ\u0080\u0099s DevSecOps platform unique. We will invest in developing best-in-class features in areas such as build and deployment, security and compliance, and enterprise agile planning so that GitLab can replace existing best-in-class point DevSecOps solutions."
  },
  {
    "header": "Drive adoption of GitLab Ultimate",
    "content": "Due to the increasing demands for security and compliance in software development, GitLab Ultimate continues to gain popularity with our customers. We will focus on increasing the value of Ultimate by not only improving security and compliance functionality but also adding value from other key areas within our platform like Plan, Verify, and Data Science."
  },
  {
    "header": "Differentiate",
    "content": "Our primary point of differentiation is our single application approach: all aspects of our DevSecOps platform work seamlessly together, right out of the box, and can be tailored to the specific needs of each organization. For FY24, we will reinforce our competitive differentiation by focusing on development that improves the platform as a whole such as improvements to usability, analytics and observability, scalability and deployment, and purchasing ease."
  },
  {
    "header": "Fiscal year product investment themes",
    "content": "Every year at GitLab, we choose some specific areas of emphasis to help guide the teams on the areas of our product that we want to accentuate. This section is used to highlight that emphasis. It is not a comprehensive list of everything we plan to do this year. Direction for each stage and category can be found at the respective direction pages. We are not asking the teams to deviate from their core mission. Many teams will see themselves contributing to these areas of emphasis directly. The other teams will continue to execute on their mission - that is also important. The themes are to help facilitate cross-team collaboration when invariably teams working on the 1-year themes may need to collaborate with others. Our guidance is: if any team approaches you to prioritize something that is thematic for this year, consider that as a higher priority than you would normally - as it is in service of the broader product-wide goal that we, as a company, have deemed important to accomplish this year. See Product Investment (internal handbook page) for how we allocate our R&D investment across our product hierarchy."
  },
  {
    "header": "FY25 R&D Investment Themes",
    "content": "For FY25, the four key R&D investment themes we are focused on are:"
  },
  {
    "header": "Enable AI/ML Efficiencies Across DevSecOps",
    "content": "AI as part of software development has continued to mature and has become the number one topic in our customer discussions. To meet our customersâ\u0080\u0099 needs and the evolving market landscape, we will take a three pronged approach to AI (GitLab Duo, ModelOps, AI agents) as part of our DevSecOps platform providing us differentiation in the market. Examples deliverables of this theme are:"
  },
  {
    "header": "Drive Use Case Adoption to Fully Realize Value",
    "content": "CI/CD is critical to the success of Premium, while security and governance drives value in Ultimate. We will increase our focus on adoption of these areas - ensuring that customers realize the value of the capabilities they have paid for. This will continue to reduce churn, drive free-to-paid conversion, and increase up-tiering from Premium to Ultimate. Example deliverables of this theme are:"
  },
  {
    "header": "Differentiate on DevSecOps Platform",
    "content": "Toolchain consolidation continues to come up with customers as well as in our annual DevSecOps survey. We will capitalize on our position as the enterprise DevSecOps platform by continuing to expand our planning capabilities, continuing to mature our metrics and reporting, and bring new SCM capabilities to general availability. Example deliverables of this theme are:"
  },
  {
    "header": "Strengthen Our SaaS Deployments & Capabilities",
    "content": "GitLab.com and GitLab Dedicated continue to grow in popularity as more organizations need to undergo digital transformations however do not want the overhead of self-hosting their DevSecOps platform. We expect this trend to continue in FY25 and will invest in our SaaS deployments to ensure they meet our customersâ\u0080\u0099 expectations. Example deliverables of this theme are:"
  },
  {
    "header": "DevSecOps stages",
    "content": "DevSecOps is a broad space with a lot of complexity. To manage this within GitLab,\nwe break down the DevSecOps lifecycle\ninto a few different sections, each with its own direction page you can review."
  },
  {
    "header": "Your contributions",
    "content": "In addition to addressing the DevSecOps lifecycle internally through the above sections, contributions from the community also help increase our rate of innovation, which helps mature the stages of our DevSecOps platform. These community contributions are an important part our company mission and strategy. Our issue tracker contains requests made for features and changes to GitLab. Contributing is the best way to\nget a feature you want included as we continually merge code to be released in the next version. Please see our Contribute to GitLab page for more details such as guides to get started contributing, areas looking for contributions, and contribution\nacceptance criteria."
  },
  {
    "header": "Personas",
    "content": "Personas are the people we design for. Developers, security professionals, and operations professionals are currently the primary personas we focus on, and we tailor our user experience to their needs. We want GitLab to be the main interface for people in these roles, so they can show up at work, start their day, and load up GitLab. And thatâ\u0080\u0099s already happening. But there are a lot of other roles involved with the development and delivery of software. That is the ultimate GitLab goal - where everyone involved with software development and delivery uses a single application so they are on the same page with the rest of their team. We are rapidly expanding our user experience for Designers, Compliance Managers, Product Managers, and Release Managers. Weâ\u0080\u0099ll also be expanding to the business side, with Executive visibility and reporting. While weâ\u0080\u0099re still calling it DevSecOps, weâ\u0080\u0099re really expanding the definition of DevSecOps and delivering it all as a single application."
  },
  {
    "header": "Mitigating low-end disruption",
    "content": "GitLab is not immune to disruption. In some ways, it is a sign of success that GitLab is now at a scale where we have to think about low-end disruption. Arguably, a few years ago, GitLab was a low-end disruptor. Clayton Christensen defines low-end-disruption as follows: Low-end disruption refers to businesses that come in at the bottom of the market and serve customers in a way that is \"good enough.\" These are generally the lower profit markets for the incumbent and thus, when these new businesses enter, the incumbents move further \"upstream.\" In other words, they put their focus on where the greater profit margins are. Our perspective is that low-end disruption is an additional and critical sensing mechanism. This is especially true for the DevSecOps market. We look at the following attributes to figure out if a low-end disruption has anything close to potential product-market resonance. This list is an adaptation of the Product Zeitgeist Fit. A reason low-end disruptors are able to enter the market is that the feature-absorption by users is lower than the feature-velocity of the established vendor. To address this we are focused on a working-by-default configuration principle."
  },
  {
    "header": "Maturity",
    "content": "As we add new categories and stages to GitLab, some areas of the product will be deeper and more mature than others. We publish a\nlist of the categories, what we think their maturity levels are, and our plans to improve on our categories page. We strive to be the best product in the market and to be complete. As the market, customer needs, competitive landscape, and technology change, we should expect our maturities to also change, including changing to a lower maturity rating. By embracing a focus on improvement and low level of shame, we encourage moving a maturity down. This is a strong indicator that we are realists about our product with an eye on achieving the best results for our customers."
  },
  {
    "header": "Scope",
    "content": "We try to prevent maintaining functionality that is language or platform\nspecific, because they slow down our ability to get results. Examples of how we\nhandle it instead are: Outside our scope are Kubernetes and everything it depends on: During a presentation of Kubernetes, Brendan Burns talks about the four Ops layers\nat the 2:00 mark: GitLab helps you mainly with application ops. And where needed, we also allow you\nto monitor clusters and link them to application environments. But we intend to\nuse vanilla Kubernetes, instead of something specific to GitLab. Also outside our scope are products that are not specific to developing,\nsecuring, or operating applications and digital products. In scope are things that are not mainly for SaaS applications: We expect GitLab to continue to grow, and we have several ideas for possible future stages"
  },
  {
    "header": "Quarterly Objectives and Key Results (OKRs)",
    "content": "To make sure our goals are clearly defined and aligned throughout the\norganization, we make use of OKRs (Objectives and Key Results). Our quarterly Objectives and Key Results\nare publicly viewable."
  },
  {
    "header": "How we plan releases",
    "content": "At GitLab, we strive to be ambitious,\nmaintain a strong sense of urgency, and set aspirational targets with every\nrelease. The direction items we highlight in our kickoff\nare a reflection of this ambitious planning. When it comes to execution, we aim\nfor\nvelocity over predictability.\nThis way, we optimize our planning time to focus on the top of the queue and\ndeliver things fast. We schedule 100% of what we can accomplish based on past Development Department merge request rate\nand availability factors (vacation, contribute, etc.). See our product handbook on how we prioritize."
  },
  {
    "header": "Previous releases",
    "content": "On our releases page, you can find an overview of the most\nimportant features of recent releases and links to the blog posts for each\nrelease."
  },
  {
    "header": "Upcoming releases",
    "content": "GitLab releases a new version every single month. You can find the\nmajor planned features for upcoming releases on our upcoming releases page or see the upcoming features for paid tiers. Note that we often move things around, do things that are not listed, and cancel\nthings that are listed."
  },
  {
    "header": "ML/AI at GitLab",
    "content": "With Gitlab 15.4, Suggested Reviewers was released as our first customer-facing ML/AI technology in production features. We have additional ambitions in the near future for several types of problems. This is the focus of our new ModelOps stage."
  },
  {
    "header": "Cross-Stage efforts",
    "content": "GitLab consistently strives to deliver a cohesive experience that enables workflows that span the DevSecOps loop. We have a number of existing capabilities and planned improvements that do just that:"
  }
]