[
  {
    "header": "\n                Collaboration\n              ",
    "content": "\n                We prioritize things that help us work together effectively, such as assuming positive intent, saying â\u0080\u009cthanksâ\u0080\u009d and â\u0080\u009csorry,â\u0080\u009d and giving timely feedback.\n              "
  },
  {
    "header": "\n                Results for Customers \n              ",
    "content": "\n                We operate with a sense of urgency and bias for action and we do what we promise because we exist to help our customers achieve more.\n              "
  },
  {
    "header": "\n                Efficiency\n              ",
    "content": "\n                From choosing boring solutions to documenting everything and being managers of one, we strive to make fast progress on the right things.\n              "
  },
  {
    "header": "\n                Diversity, Inclusion, & Belonging\n              ",
    "content": "\n                We work to ensure GitLab is a place where people from every background and circumstance feel like they belong and can thrive.\n              "
  },
  {
    "header": "\n                Iteration\n              ",
    "content": "\n                We aim to do the smallest viable and valuable thing, and get it out quickly for feedback.\n              "
  },
  {
    "header": "\n                Transparency\n              ",
    "content": "\n                Everything we do is public by default, from our company handbook to the issue trackers for our product.\n              "
  },
  {
    "header": "\n          2011\n        ",
    "content": "\n          The GitLab project began with a commit\n        "
  },
  {
    "header": "\n",
    "content": "\n          We started releasing a new version of GitLab on the 22nd of every month\n        "
  },
  {
    "header": "\n          2012\n        ",
    "content": "\n          The first version of GitLab CI is created\n        "
  },
  {
    "header": "\n          2014\n        ",
    "content": "\n          GitLab is incorporated\n        "
  },
  {
    "header": "\n          2015\n        ",
    "content": "\n          Joined Y Combinator and published the GitLab Handbook to our website repository\n        "
  },
  {
    "header": "\n          2016\n        ",
    "content": "\n          Announced our master plan and raised $20 million in B round financing\n        "
  },
  {
    "header": "\n          2021\n        ",
    "content": "\n          GitLab Inc. became a publicly traded company on the Nasdaq Global Market (NASDAQ: GTLB)\n        "
  },
  {
    "header": "\n        Better teams. Faster progress. Better world.\n      ",
    "content": "\n        TeamOps is GitLab's unique people practice which makes teamwork an objective discipline. It's how GitLab scaled from a startup to a global public company in a decade. Through a free and accessible practitioner certification, other organizations can leverage TeamOps to make better decisions, deliver results, and move our world forward.\n      "
  }
]